burning-airlines-server/app/views/flights/index.html.erb

SELECT  "planes".* FROM "planes" WHERE "planes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    <li>
      <%= flight.date %> - <%= flight.id %> - <%= flight.origin %> > <%= flight.destination %> - <%= flight.plane.name %> <%= flight.plane.rows*flight.plane.columns-flight.reservations.length %>