burning-airlines-server/app/controllers/flights_controller.rb

  def create
    flight = Flight.create flight_params
---
INSERT INTO "flights" ("plane_id", "date", "destination", "origin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["plane_id", 10], ["date", "2009-05-06"], ["destination", "sydney"], ["origin", "cammeray"], ["created_at", "2018-10-30 14:29:38.259515"], ["updated_at", "2018-10-30 14:29:38.259515"]]

  def search
    flights = Flight.where(origin: params[:origin]).where(destination: params[:destination])
---
SELECT "flights".* FROM "flights" WHERE "flights"."origin" = $1 AND "flights"."destination" = $2  [["origin", "SYD"], ["destination", "BNE"]]

  def destroy
    flight = Flight.find(params[:id])
    flight.destroy
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "flights" WHERE "flights"."id" = $1  [["id", 3]]