burning-airlines-server/app/controllers/planes_controller.rb

INSERT INTO "planes" ("rows", "columns", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["rows", 0], ["columns", 0], ["created_at", "2018-10-30 14:11:03.692413"], ["updated_at", "2018-10-30 14:11:03.692413"]]
---
  def create
    plane = Plane.create( plane_params )

SELECT "planes".* FROM "planes"
---
  def index
    @plane = Plane.new
    @planes = Plane.all.reverse

SELECT  "planes".* FROM "planes" WHERE "planes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "planes" WHERE "planes"."id" = $1  [["id", 5]]
---
  def destroy
    plane = Plane.find(params[:id])
    plane.destroy